#+title: Ps 06
#+author: Erik An
#+email: obluda2173@gmail.com
#+date: <2026-04-26>
#+lastmod: <2026-04-26 21:59>
#+latex: \newpage
#+latex_header: \setlength{\parindent}{0pt}
#+latex_header: \setlength{\parskip}{1em}
#+latex_header: \usepackage{amsmath}
#+latex_header: \usepackage{amssymb}
#+latex_header: \usepackage{mathtools}
#+latex_header: \usepackage{amsthm}
#+latex_header: \usepackage[margin=1in]{geometry}
#+options: num:t tags:nil
#+property: header-args :eval never-export
#+startup: overview latexpreview inlineimages

*** (b)

#+begin_src julia :results value :exports both :tangle julia/p_03.jl
using Plots

f(x, y) = x^2 + y^2 + 2x + 4y

xs = range(-5, 3, length=200)
ys = range(-6, 2, length=200)

heatmap(xs, ys, (x, y) -> f(x, y), aspect_ratio=1,
        xlabel="x", ylabel="y", title="f(x,y) = xÂ˛ + yÂ˛ + 2x + 4y")

scatter!([-1], [-2], color=:red, label="min (-1,-2)")

mkpath("./assets")
savefig("./assets/p_03_b.png")
#+end_src

#+RESULTS:
: /Users/ziro2173/personal/mfds/01_bachelor/02_semester/01_analysis/02_exercises/ps_06/assets/p_03_b.png

*** (b)

#+begin_src julia :results value :exports both :tangle julia/p_04.jl
using Plots

f(x, y) = x^2 + 3y^2 + 2x*y

xs = range(-4, 4, length=200)
ys = range(-4, 4, length=200)

heatmap(xs, ys, (x, y) -> f(x, y), aspect_ratio=1,
        xlabel="x", ylabel="y", title="f(x,y) = xÂ˛ + 3yÂ˛ + 2xy")

scatter!([0], [0], color=:red, label="min (0,0)")

mkpath("./assets")
savefig("./assets/p_04_b.png")
#+end_src

#+RESULTS:
: /Users/ziro2173/personal/mfds/01_bachelor/02_semester/01_analysis/02_exercises/ps_06/assets/p_04_b.png

